<div class="task">
  <h4 class="center-align"><strong>Практическая работа «Создание простейшей страницы-визитки»</strong></h4>
</div>

<p>В этом и последующих юнитах у вас будет возможность <strong>отправить своё решение на проверку</strong>. Чтобы не
  прикладывать его каждый раз, сохраните файл с решением этих задач уже сейчас — в&nbsp;конце модуля вы сможете
  загрузить его в итоговую форму проверки.
</p>

<div class="task-list">
  <ol>
    <li>Перейдите в папку вашего локального веб-сервера, где будет создаваться проект.
    </li>
    <li>Создайте папку вашего проекта и в ней все необходимые файлы.
    </li>
    <li>Не забудьте подключить в <code>
        index.php&nbsp;— main.php.</code>
    </li>
    <li>Создайте разметку желаемой структуры сайта и примените стили.
    </li>
    <li>Запустите локальный веб-сервер и посмотрите результат в браузере. Если это XAMPP, страницу нужно открыть
      самим и в адресную строку ввести адрес
      <code>
          localhost.
        </code>
    </li>
    <li>Создайте код
      <em>
        PHP
      </em>
      в файле
      <code>
          index.php 
        </code>
      и код
      <code>
          php
        </code>
      в блоке со знаниями, в
      котором будут продемонстрированы основные полученные знания.
    </li>
    <li>Выведите строки, переменные, результаты выполнения кода в разметке в файле
      <code>main.php</code>.
      Визуальный контент в браузере&nbsp;— это результат вывода переменных, блоков с кодом и подключенных файлов.
      Из верстки у вас только контейнеры с примененными стилями. А контейнеры уже содержат подключенные
      переменные, включенный код&nbsp;
      <em>PHP</em>&nbsp;и подключенные файлы. У нас динамическая страница!
    </li>
    <li>Проверьте результаты в браузере и, если нужно, подкорректируйте вашу работу.
    </li>
    <li>
      <span style="text-decoration: underline;">
      <a href="https://github.com/55577799/practice/tree/gh-pages"
          target="_blank">
          Образец при создании проекта</a>.
        </span>
    </li>
  </ol>
</div>